Rails.application.routes.draw do
  root to: 'posts#index'
  post 'posts', to: 'posts#create'

  ################################################################################################################################################
  #2.5 JSからURLが飛んでくる。カリキュラムはJS→コントローラーとされているが、実際はルーティングを通る。(JSがコントローラーと連携するには、ルーティングを通る必要あり？)　 
  #飛んでくるのはエンドポイント ≒ URL (?) 
  ################################################################################################################################################
  get 'posts/:id', to: 'posts#checked'
end